_site/app/controllers/omniauth_callbacks_controller.rb

	def twitter
		if Current.user.twitter_accounts.any?

			twitter_account = Current.user.twitter_accounts.where(username: auth.info.nickname).first_or_initialize
			twitter_account.update(
				name:auth.info.name,
				username: auth.info.nickname,
				image: auth.info.image,
				token: auth.credentials.token,
				secret: auth.credentials.secret,
				)
			redirect_to twitter_accounts_path, notice: "Conta do twitter conectada com sucesso!"
		else # If there is no twitter account associated

			TwitterAccount.create(user_id: Current.user[:id],username: auth.info.nickname, name:auth.info.name,
				image: auth.info.image,
				token: auth.credentials.token,
				secret: auth.credentials.secret, )
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."username" = ? ORDER BY "twitter_accounts"."id" ASC LIMIT ?  [["user_id", 6], ["username", "biser_game"], ["LIMIT", 1]]
INSERT INTO "twitter_accounts" ("user_id", "name", "username", "image", "token", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)