app/controllers/registration_controller.rb

SELECT "users".* FROM "users" WHERE (opa) LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		if User.find_by(params[:email]) == nil
			@user = User.new(user_params)
			if @user.save