app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "publish_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["twitter_account_id", 3], ["body", "Olá! 123"], ["publish_at", "2021-08-09 15:01:00"], ["created_at", "2021-08-09 14:24:45.523620"], ["updated_at", "2021-08-09 14:24:45.523620"]]
INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "publish_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["twitter_account_id", 3], ["body", "Olá! 123"], ["publish_at", "2021-08-09 15:01:00"], ["created_at", "2021-08-09 14:20:07.473723"], ["updated_at", "2021-08-09 14:20:07.473723"]]
---
	def create
		@tweet = Current.user.tweets.create(tweet_params)
		if @tweet.save

UPDATE "tweets" SET "body" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["body", "Pizda!"], ["updated_at", "2021-08-11 00:13:11.489344"], ["id", 3]]
---
	def update
		if @tweet.update(tweet_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 3], ["id", 4], ["LIMIT", 1]]
---
	def set_tweet
		@tweet = Current.user.tweets.find(params[:id])