app/controllers/twitter_accounts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."id" = ? LIMIT ?  [["user_id", 6], ["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
---
	def index


		if Current.user.twitter_accounts.any?

SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."id" = ? LIMIT ?  [["user_id", 6], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "twitter_accounts" WHERE "twitter_accounts"."id" = ?  [["id", 2]]
---
	def destroy
		@twitter_account = Current.user.twitter_accounts.find(params[:id])
		@twitter_account.destroy